7767517
32 34
Input                    in0                      0 1 in0
Convolution              convclip_0               1 1 in0 1 0=16 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 9=3
Convolution              convclip_1               1 1 1 2 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=3
ConvolutionDepthWise     convdwclip_0             1 1 2 3 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32 9=3
Convolution              conv_5                   1 1 3 4 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Convolution              convclip_2               1 1 4 5 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=3
ConvolutionDepthWise     convdwclip_1             1 1 5 6 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=3
Convolution              conv_7                   1 1 6 7 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Convolution              convclip_3               1 1 7 8 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072 9=3
ConvolutionDepthWise     convdwclip_2             1 1 8 9 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96 9=3
Convolution              conv_9                   1 1 9 10 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              convclip_4               1 1 10 11 0=144 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912 9=3
ConvolutionDepthWise     convdwclip_3             1 1 11 12 0=144 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 7=144 9=3
Convolution              conv_11                  1 1 12 13 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Split                    splitncnn_0              1 3 13 14 15 16
Pooling                  gap_0                    1 1 15 17 0=1 4=1
Reshape                  view_34                  1 1 17 18 0=64
InnerProduct             fcrelu_0                 1 1 18 19 0=16 1=0 2=1024 9=1
InnerProduct             fcsigmoid_4              1 1 19 20 0=64 1=0 2=1024 9=4
Reshape                  view_35                  1 1 20 21 0=1 1=1 2=64
Pooling                  gmp_2                    1 1 16 22 0=0 4=1
Reshape                  view_36                  1 1 22 23 0=64
InnerProduct             fcrelu_1                 1 1 23 24 0=16 1=0 2=1024 9=1
InnerProduct             fcsigmoid_5              1 1 24 25 0=64 1=0 2=1024 9=4
Reshape                  view_37                  1 1 25 26 0=1 1=1 2=64
BinaryOp                 add_0                    2 1 21 26 27 0=0
BinaryOp                 mul_1                    2 1 14 27 28 0=2
Pooling                  gap_1                    1 1 28 29 0=1 4=1
Reshape                  view_38                  1 1 29 30 0=64
InnerProduct             fcrelu_2                 1 1 30 31 0=128 1=1 2=8192 9=1
InnerProduct             fcrelu_3                 1 1 31 32 0=64 1=1 2=8192 9=1
InnerProduct             linear_18                1 1 32 out0 0=2 1=1 2=128
